package com.example.mente.ADHD.Data

class AdhdData {

    companion object{
        val AdhdData = mutableListOf(
            "ضعف مدى الانتباه",
            "يحتاج إلى جهد للانتباه إلى تعليمات" +
                    " المعلم ",
            "يعاني من الذهول والحيرة أو الارتباك",
            "الفشل في إتمام المهام أو الأنشطة التي" +
                    " يبدأ بها .",
            "انتقال الطفل من شيء لأخر أو من نشاط" +
                    " لأخر بشكل مزعج وغير هادف",
            "لا يصغي أو يستمع للآخرين",
            "ليس لديه القدرة على متابعة التفاصيل ",
            "ليس لديه القدرة على الفهم والاستيعاب وإدراك العلاقات",
            "ليس لديه القدرة على التركيز ",
            " يعاني من تخلف دراسي أو صعوبة في" +
                    " مجال التعلم ",
            "يعاني من الشرود وأحلام اليقظة ",
            "كثير ما ينشغل بذاته",
            "تشتت انتباهه بسرعة بفعل المثيرات" +
                    " وبشكل غير عادي ",
            "ينسى الأشياء الهامة لإنهاء المهام ",
            "يفشل في تنظيم المهام وتنفيذها .",
            "يفشل في متابعة التعليمات التي توجه" +
                    " إليه . ",
            "يتجنب المهام التي تتطلب جهدا عقليا وانتباها " +
                    " وإدراكا وغير ذلك",
            "التعرض للحوادث بسبب نقص الانتباه ",
            "يفقد بعض الأشياء والأدوات",
            "عدم الاهتمام أو اللامبالاة بعملية التعلم",
            "الخروج من الصف عدة مرات دون مبرر",
            "سلوكيات متكررة لدرجة الإزعاج",
            "عدم الراحة مع الإحساس بالملل والتلوي" +
                    " أثناء الجلوس على المقعد",
            "يسبب صخبا وضوضاء داخل الصف",
            "يزعج الأطفال الآخرين في الصف ولا" +
                    " ينسجم معهم ",
            "غير متعاون مع معلميه أو المشرفين" +
                    " عليه",
            "لا يستجيب لتعليمات متمرد أو خارج عن" +
                    " الطاعة ",
            "يظهر سلوك العناد والمعارضة ",
            "تظهر عليه أعراض اللامبالاة أو الإهمال",
            " يمكن أن يدفع الآخرين في الصف ",
            "عدم ممارسة الأنشطة",
            "التواصل الاجتماعي مع الآخرين ضعيف",
            "يتهم الآخرين باستمرار ",
            "تغيب عن المدرسة دون عذر",
            "يخالف الأنظمة والمواعيد ويكره أن تقيده" +
                    " النظم أو القواعد ",
            "يتجنب الأعذار",
            "سلوكه لا يمكن توقعه",
            "من السهل قيادته من الأطفال الآخرين",
            "يتكلم كثيرا بشكل مختلف عن الأطفال الاخرين من نفس العمر (كلام ،طفلي ، تهته )",
            "لا يستطيع السيطرة على أفعاله",
            " يجب أن تؤدي مطالبه في الحال ",
            "انفجار المزاج والقيام بسلوك غير" +
                    " متوقع ",
            "حساس بشدة لعملية النقد ",
            "يبكي كثيرا وبسهوله ",
            "صعوبة إرجاء رد الفعل أو الاستجابة ",
            " يجيب عن السؤال قبل أتمامه",
            "محب للعراك ودائما في حالة غضب" +
                    " واستياء .",
            " إقحام نفسه في أمور لا مبرر لها ",
            "مقاطعة الآخرين في الحديث ",
            "غير قادر على إيقاف حركاته" +
                    " المتكررة . ",
            "ينكر الأخطاء ولوم الآخرين له ",
            "مطيع باستياء وبامتعاض .",
            "وقاحة مع قلة الحياء في أفعاله",
            "ضرب الآخرين بعنف ",
            "يركض ويقفز بسرعة ",
        )
    }
}