package com.example.mente.ADHD.Data

class MentalHealthData {
    companion object{
        val MentalHealthData = mutableListOf(
           "هل يشعر الشخص بالتوتر؟",
           "هل يعاني الشخص من اضطراب الهلع؟",
           "هل يعاني الشخص من التنفس السريع؟",
           "هل يعاني الشخص من التعرق المفرط؟",
           "هل يواجه الشخص صعوبة في التركيز؟",
           "هل يعاني الشخص من صعوبة في النوم؟",
           "هل يواجه الشخص مشاكل في العمل؟",
           "هل يشعر الشخص باليأس؟",
           "هل يشعر الشخص بالغضب؟",
           "هل يتفاعل الشخص بشكل مبالغ فيه مع المواقف؟",
           "هل شهد الشخص تغيرًا في عاداته الغذائية؟",
           "هل لدى الشخص أفكار انتحارية؟",
           "هل يشعر الشخص بالتعب؟",
           "هل لدى الشخص صديق قريب للاستناد إليه؟",
           "هل يعاني الشخص من إدمان وسائط التواصل الاجتماعي؟",
           "هل شهد الشخص زيادة في وزنه؟",
           "هل يعتبر الشخص منغمسًا في ذاته؟",
           "هل تظهر ذكريات مؤذية بانتظام لدى الشخص؟",
           "هل يعاني الشخص من كوابيس؟",
           "هل يتجنب الشخص التواجد مع الناس أو ممارسة أنشطة محددة؟",
           "هل يشعر الشخص بالسلبية؟",
           "هل يواجه الشخص صعوبة في التركيز؟",
           "هل يحمِّل الشخص نفسه مسؤولية كافة أمور تفشل في حققانها؟",
           "هل يتعرض الشخص لأوهام بصرية أو سمعية؟",
           "هل يمارس الشخص سلوكيات تكرارية؟",
           "هل تحدث هذه الأعراض موسميًا أو خلال فترات زمنية محددة من السنة؟",
           "هل شهد الشخص زيادة في مستويات طاقته مؤخرًا؟",
        )
    }
}