package com.example.mente.Data.QuestionsSpecialist.neuralScreening

import com.example.mente.Models.Question

class DataNeural{

companion object{


    var neuralDataList = mutableListOf(
        Question(1,"(1) يمسك القلم بطريقة غير متقنة ، متوترة" ,1),
        Question(2,"(2) يكتب بحروف غير متصلة( لمن هم فوق الثامنة )" ,1),
        Question(3," (3) يقرب عينيه من الورقة أثناء الكتابة " ,1),
        Question(4," (4) يرتعش بوضوح اثناء الكتابة " ,3),


//        List2
        Question(5,"(1) يتعرف على اقل من خمس اشكال" ,1),
        Question(6,"(2) يرسم الاشكال بطريقة افقية" ,1),
        Question(7,"(3) يرسم الاشكال ببطء شديد أو بسرعة كبيرة" ,1),
        Question(8,"(4) يرسم الاشكال كبيرة جداً ، صغيرة جداً ، أو بطريقة شاذة" ,1),
        Question(9,"(5) يدير الورقة أثناء الرسم" ,1),
        Question(10,"(6) يرسم الاشكال مائلة إلى اليمين ، أو إلى اليسار" ,1),
        Question(11,"(7) يتمم إلى نفسه اثناء الرسم" ,1),
        Question(12,"(8) يرسم الاشكال ناقصة (اغلاق غير جيد)" ,1),
        Question(13,"(9) يرسم الزوايا بطريقة خاطئة" ,3),
        Question(14,"(10) يرتعش بوضوح أثناء الرسم" ,3),


//        List3
        Question(15,"(1) الاستجابة بالحروف بدالً من االرقام" ,1),
        Question(16,"(2) اليد اليمنى 3 (أ)" ,1),
        Question(17,"(3)   9 (ق)" ,1),
        Question(18,"(4)  5 (ة)" ,1),
        Question(19,"(5) 7(ن)" ,1),
        Question(20,"(6) اليد اليسرى 2(ك) " ,1),
        Question(21,"(7) 8(ل)" ,1),
        Question(22,"(8) 4(ع)" ,1),
        Question(23,"(9) 6(د)" ,1),

//    List4
    Question(24,"يحرك رأسه أثناء المتابعة البصرية",1),
    Question(25,"يهتز اهتزازاً تشنجياً(أفقياً)",1),
    Question(26,"يهتز اهتزازاً تشنجياً(رأسياً)،وعدم تآزر",3),
    Question(27,"يتشتت انتباهه أثناء الأداء",3),

//    List5
    Question(28," (1) ينجح فى محاكاه نمط ايقاعى واحد فقط (حركى / لفظى)" ,1),
    Question(29," (2) يخطئ فى محاكاه احد الانماط التتابعية" ,1),
    Question(30," (3)  يبدل الايدى ، يستخدم يد واحدة ، يصفق بيديه" ,1),
    Question(31,"(4) لا ينجح فى المحاكاه الا حين يقدم إليه النمط بصوت عالى جدا" ,1),
    Question(32,"(5) يبدل فى محاكاه األنماط الصوتية (1-2-3) بدلا من (1-3-2)" ,1),
    Question(33," (6) يظهر جوانب شذوذ فى الكالم (مثل التلعثم)" ,1),
    Question(34," (7) يستمر فى المحاكاه (ال يعرف متى يتوقف)" ,3),
    Question(35," (8) يخطئ فى المحاكاه اللفظية (نمطين او اكثر)" ,3),
    Question(36," (9) يخطئ فى المحاكاه الحركية (نمطين او اكثر)" ,3),


//        List6
        Question(37," (1) ﯾؤدى اﻟﻣﮭﻣﺔ ﺑﺳرﻋﺔ أو ﺑﺑطء ﻋﺎدٍة " ,1),
        Question(38," (2)  يحرك اليد بانتظام نحو يمين أو يسار الهدف فى الفراغ (أنفه )" ,1),
        Question(39," (3)  يحرك اليد بانتظام إلى أعلى أو أسفل الهدف فى الفراغ (أنفه )" ,1),
        Question(40,"(4) ﯾﻠﻣس ﻣﻛﺎﻧﺎً ﺑﻌﯾداً ﻋن طرف أﻧﻔﮫ (ﺑﻧﺻف ﺑوﺻﺔ أو ﺑوﺻﺔ)" ,1),
        Question(41," (5) ﯾﻠﻣس ﻣﻛﺎﻧﺎً ﺑﻌﯾداً ﻋن طرف أﻧﻔﮫ ﺑﺄﻛﺛر ﻣن ﺑوﺻﺔ  (ﻻﺣظ إذاﻛﺎن اﻟﻠﻣس ﻓﻰ ﻣﻛﺎن ﺑﻌﯾد داﺋﻣﺎ)" ,3),
        Question(42," (6) ﻻ ﯾﺳﺗطﯾﻊ اﻟﺳﯾطرة اﻻرادﯾﺔ ﻋﻠﻰ ﺣرﻛﺔ اﻟذاﻋﯾن" ,3),

// List7

        Question( 43," (1) ﯾﻛون اﻟدواﺋر ﺑطرﯾﻘﺔ ﻋﻛﺳﯾﺔ (ﯾﺑدأ ﻣن اﻹﺻﺑﻊ اﻟﺻﻐﯾر و ﯾﻧﺗﮭﻰ ﺑﺎﻟﺳﺑﺎﺑﺔ) " ,1),
        Question( 44," (2)  ﯾﺣرك أﺻﺎﺑﻊ ﯾده اﻷﺧرى ﺣرﻛﺔ ﺑﺳﯾطﺔ أﺛﻧﺎء اﻷداء" ,1),
        Question( 45," (3)  ﯾﻛون دواﺋر ﻣﻔرطﺣﺔ أو ﺻﻐﯾرة ﺟداً ، أو ﻏﯾر ﻛﺎﻣﻠﺔ" ,1),
        Question( 46,"(4) ﯾرﻓﻊ ﯾده أﻣﺎﻣﮫ أو ﯾرﻛز ﻋﻠﯾﮭﺎ - ﺑﻘﺻد - أﺛﻧﺎء اﻷداء" ,1),
        Question( 47," (5) ﯾﺣرك ﺟﺳﻣﮫ ﻛﻠﮫ - أو اﻟﺟﺎﻧب اﻵﺧر ﻣﻧﮫ - ﺣرﻛﺔ ﻋﺷواﺋﯾﺔ" ,3),
        Question( 48," (6) ﯾرﺗﺑك ﻓﻰ ﺗﺣدﯾد اﻹﺻﺑﻊ اﻟﺗﺎﻟﯾﺔ ﻓﻰ ﺗﻛوﯾن اﻟدواﺋر ، أو ﯾﺗﺧطﻰ إﺻﺑﻌﺎً" ,3),

// List8

        Question(49," (1) ﯾﮭﺗز ﻻ إرادﯾﺎ ﺣﯾن ﯾﺣس ﺑﻠﻣﺳﺔ ﻋﻠﻰ ﺧده" ,1),
        Question(50," (2) ﻻ ﯾﺷﻌر أﺣﯾﺎﻧﺎً ﺑﺎﻟﻠﻣﺳﺔ ﻋﻠﻰ ﯾده " ,1),
        Question(51," (3)  ﻻ ﯾﺷﻌر ﺑﻠﻣﺳﺔ اﻟﯾد ﻋﻠﻰ ﻛﻼ اﻟﺟﺎﻧﺑﯾن  (ظﺎھرة ﻋﺎدﯾﺔ ﻟدى اﻗل ﻣن ٦ ﺳﻧوات )" ,3),
        Question(52," (4)  ﻻ ﯾﺷﻌر داﺋﻣﺎً ﺑﻠﻣﺳﺔ اﻟﯾظ ﻋﻠﻰ ﺟﺎﻧب واﺣد ﻣن اﻟﺟﺳم" ,3),
        Question(53,"(5) ﯾﺧطﺊ ﻓﻰ اﻹدراك اﻟﺣﺳﻲ  (ﻣﺛﺎل : ﺗﺳﻣﯾﺔ ﺧﺎطﺋﺔ ﻟﻣﻛﺎن اﻟﻠﻣس)" ,3),


//        List9

        Question(54," (1) ﯾﺗﺧﺑط ﻓﻰ ﺗﻘﻠﯾب اﻟﯾدﯾن أو ﻓﻰ ﺗﺣرﯾك اﻷﺻﺎﺑﻊ" ,1),
        Question(55," (2) ﯾﻘﻠب ﯾدﯾﮫ ﺑﻣﻌدل ﺳرﯾﻊ أو ﺑطﺊ  " ,1),
        Question(56," (3)  ﺗرﺗد اﻟﯾدان ﺑﺳرﻋﺔ ﻓﺟﺎﺋﯾﺔ ، أو ﺗﻛون اﻷﺻﺎﺑﻊ ﻓﻰ وﺿﻊ ﻣﺗﺻﻠب" ,1),
        Question(57,"(4) ﯾﻘﻠب ﯾدﯾﮫ ﻓﻰ ﺣرﻛﺎت داﺋرﯾﺔ ﻛﺑﯾرة  (ﻗدرھﺎ ﻗدم واﺣدة)" ,3),
        Question(58,"(5) ﯾﻘﻠب ﯾدﯾﮫ ﺑﺷﻛل ﻏﯾر ﻣﺗﺳق   (ﺗﺧﺗﻠف إﺣدى اﻟﯾدﯾن ﻋن اﻷﺧرى)" ,3),

//        List10
        Question(59," (1) ﯾﺣرك ﺟﺳﻣﮫ ، أو ﯾده ، أو ﻟﺳﺎﻧﮫ ﺣرﻛﺔ ﻋﺷواﺋﯾﺔ " ,3),
        Question(60," (2) ﯾظﮭر ﺗوﺗراً ﻋﺿﻠﯾﺎً ﺷدﯾداً (ﻻﺣظ ﻓرط أو ھﺑوك اﻹﯾﻘﺎع اﻟﺣرﻛﻰ) " ,3),
        Question(61," (3) ﻻ ﯾﺳﺗطﯾﻊ إﺗﺧﺎذ اﻟوﺿﻊ اﻟﻣطﻠوب (ﺗﺗﺣرك اﻷطراف إﻟﻰ اﺳﻔل ﻻ إرادﯾﺎً)" ,3),
        Question(62,"(4) ﻻ ﯾﺳﺗطﯾﻊ إﺗﺧﺎذ اﻟوﺿﻊ اﻟﻣطﻠوب (ﯾﺗﺣرك اﻟﺟﺳم ﻛﻠﮫ إﻟﻰ اﻷﻣﺎم ﻻ إرادﯾﺎً)" ,3),
        Question(63,"(5) ﯾﻔرد اﻷﺻﺎﺑﻊ ﺑطرﯾﻘﺔ ﺷﺎذة (ﻣﺛﺎل : ﯾﺛﻧﻰ أطراف اﺻﺎﺑﻌﮫ ﺑﺣﯾث ﺗﺑدو ﻛﺎﻟﻣﺧﺎﻟب)" ,3),
        Question(64,"(6) ﺗﻧﺧﻔض اﻷﯾدى اﻟﻣﻔرودة إﻟﻰ أﺳﻔل اﻟﻣﻌﺻم" ,3),
        Question(65,"(7) ﺗرﺗﻌش أو ﺗﮭﺗز اﻟﯾدان أو اﻟرﺟﻼن ﺑﺷﻛل ﻣﻠﺣوظ " ,3),


//        List11
        Question(66," (1) ﯾﻌﺎﻧﻰ ﺻﻌوﺑﺔ ﻓﻲ اﻟﻣﺷﻰ اﻟﺗﺑﺎدﻟﻰ ﻟﻠوراء " ,1),
        Question(67," (2) ﯾﻌﺎﻧﻰ ﺻﻌوﺑﺔ ﻓﻰ اﻟﻣﺷﻰ اﻟﺗﺑﺎدﻟﻰ و اﻟﻌﯾﻧﺎن ﻣﻐﻣﺿﺗﺎن " ,1),
        Question(68," (3) ﺗﺗﺣرك إﺣدى اﻟﯾدﯾن طوﻟﯾﺎً ﻟﻠداﺧل و ﺗﺗﺣرك اﻻﺧرى ﻟﻠﺧﺎرج" ,1),
        Question(69,"(4) ﯾﻣﯾل أﺛﻧﺎء اﻟﻣﺷﻲ إﻟﻰ اﻟﯾﺳﺎر أو إﻟﻰ اﻟﯾﻣﯾن " ,1),
        Question(70,"(5) ﺧطواﺗﮫ واﺳﻌﺔ ، أو ﻣﺗداﺧﻠﺔ ﺿﯾﻘﺔ  " ,1),
        Question(71,"(6) اﻟرﻛﺑﺗﺎن ﻣﻧﺣﻧﯾﺗﺎن اﺛﻧﺎء اﻟﻣﺷﻰ" ,3),
        Question(72,"(7) ﻻ ﯾﺳﺗطﯾﻊ اﻻﺣﺗﻔﺎظ ﺑﺗواﻧﮫ (ﻻﺣظ ﺗﻣوج ﺣرﻛﺔ اﻟذراﻋﯾن) " ,3),
        Question(73,"(8) ﯾﺗﺣرك ﺟﺳﻣﮫ ﻋﺷواﺋﯾﺎً (ﻻﺣظ ھل اﻟﺣرﻛﺔ ﻓﻰ اﻟذراﻋﯾن أﻛﺛر أم اﻟرﺟﻠﯾن) " ,3),

//   List 12

        Question(74," (1) ﻻ ﯾﺳﺗطﯾﻊ اﻻﺣﺗﻔﺎظ ﺑﺗوازﻧﮫ أﺛﻧﺎء اﻟوﻗوف " ,1),
        Question(75," (2) ﻻ ﯾﺳﺗطﯾﻊ اﻟوﻗوف و اﻟﻌﯾﻧﺎن ﻣﻐﻣﺿﺗﺎن" ,1),
        Question(76,"(3) ﯾﺻﻌب ﻋﻠﮫ اﻟوﻗوف ﻋﻠﻰ اﻟرﺟل اﻟﯾﻣﻧﻰ / اﻟﯾﺳرى  " ,1),
        Question(77,"(4) ﯾﻠﺗوى ﺟﺳﻣﮫ إﻟﺗواء ﺷدﯾداً أﺛﻧﺎء اﻟوﻗوف  " ,1),

//List13
        Question(78," (1) ﻻ ﯾﺳﺗطﯾﻊ اﻻﺣﺗﻔﺎظ ﺑﺗوازﻧﮫ أﺛﻧﺎء اﻟﺣﺟل " ,1),
        Question(78," (2) ﻻ ﯾﻣﯾز ﺑﯾن اﻟﯾﻣﯾن و اﻟﯾﺳﺎر (ﺗﻼﺣظ أﯾﺿﺎً ﻓﻲ اﻻﺧﺗﺑﺎر ١٥) " ,1),
        Question(80," (3) ﯾﺳﺗطﯾﻊ اﻟوﺛب ﻋﻠﻰ رﺟل واﺣدة ﻓﻘط (اﻟﯾﻣﻧﻰ أو اﻟﯾﺳرى)" ,1),
        Question(81,"(4) ﻻ ﯾﺳﺗطﯾﻊ اﻟوﺛب ﻋﻠﻰ أى ﻣن اﻟرﺟﻠﯾن (ﺑﻌد اﻟﺳﺎدﺳﺔ ﻟﻠﺑﻧﺎت و ﺑﻌد اﻟﺛﺎﻣﻧﺔ ﻟﻸوﻻد)  " ,3),


//     List14

        Question(82," (1) ﺿﻌف اﻟﻘدرة ﻋﻠﻰ اﻟﺗﻣﯾﯾز ﺑﯾن اﻟﯾﻣﯾن و اﻟﯾﺳﺎر )ﻣن اﺧﺗﺑﺎر ﻓرﻋﻰ ٦) " ,1),
        Question(83," (2) ﺿﻌف اﻟﻘدرة ﻋﻠﻰ اﻟﺗﻣﯾﯾز ﺑﯾن اﻟﯾﻣﯾن و اﻟﯾﺳﺎر )ﻣن اﺧﺗﺑﺎر ﻓرﻋﻰ ٧) " ,1),
        Question(84," (3) ﺿﻌف اﻟﻘدرة ﻋﻠﻰ اﻟﺗﻣﯾﯾز ﺑﯾن اﻟﯾﻣﯾن و اﻟﯾﺳﺎر )ﻣن اﺧﺗﺑﺎر ﻓرﻋﻰ١٢   )" ,1),



//     List15
        Question(85," (1) ﯾﺻدر اﻧﻣﺎط ﺳﻠوﻛﯾﺔ ﺷﺎذة ( ﻛﺎﻟﻐﺑث ﺑﺎﻟﺷﻌر ، و اﻟﮭرش)… " ,1),
        Question(86," (2) ﯾﻛرر اﻟﺳﻠوك ﺑطرﯾﻘﺔ ﻗﮭرﯾﺔ (اﻟﻣﻌﺎودة) " ,1),
        Question(87," (3) ﯾﻔرط ﻓﻲ اﻟﻛﻼم اﻟﻐﯾر اﻟواﺿﺢ (اﻟﻣﺑﮭم) أﺛﻧﺎء اﻷداء" ,1),
        Question(88,"(4) ھﺎدئ ﺑﺷﻛل ﻏﯾر ﻣﻌﺗﺎد ﻣﻊ ظﮭور أﻋراض ﺳﻠوﻛﯾﺔ اﻧﺳﺣﺎﺑﯾﺔ " ,1),
        Question(89,"(5) ﯾظﮭر ﻗﻠﻘﺎً ﻣﺻﺣوﺑﺎً ﺑﺣرﻛﺎت ﻋﺻﺑﯾﺔ ) اﻟﺗﻣﻠﻣل - اﻻﻓراط ﻓﻰ اﻟﺳﻠوك اﻟﻠﻣﺳﻰ أو اﻟﺣرﻛﻰ)  " ,1),
        Question(90,"(6) ﯾﺑرر ﻣﺳﺗوى اداﺋﮫ ﺑﺷﻛل دﻓﺎﻋﻰ" ,1),
        Question(91,"(7) ﻗﺎﺑل ﻟﻼﺳﺗﺛﺎرة ، أو ﺷرود اﻟذھن ، أو اﻻﻧدﻓﺎﻋﯾﺔ  " ,1),

        )

//
//    var neuralDataList2 = mutableListOf<Question>()
//    var neuralDataList3 = mutableListOf<Question>()
//    var neuralDataList4 = mutableListOf<Question>()
//    var neuralDataList5 = mutableListOf<Question>()
//    var neuralDataList6 = mutableListOf<Question>()
//    var neuralDataList7 = mutableListOf<Question>()
//    var neuralDataList8 = mutableListOf<Question>()
//    var neuralDataList9 = mutableListOf<Question>()
//    var neuralDataList10 = mutableListOf<Question>()
//    var neuralDataList11 = mutableListOf<Question>()
//    var neuralDataList12 = mutableListOf<Question>()
//   var neuralDataList13 = mutableListOf<Question>()
//   var neuralDataList14 = mutableListOf<Question>()
//    var neuralDataList15 = mutableListOf<Question>()
//

}


}