package com.example.mente.Autism.Data.QuestionsSpecialist

import com.example.mente.Autism.Models.CarsAutismModel

class CarsAutismData {

    companion object{

        val Adhd_Questions = mutableListOf(
            CarsAutismModel("إقامة العلاقة مع الناس ",
                "طبيعي لا يوجد أي اختلاف بإقامة العلاقة بالناس وتصرفاته بمثل عمره.",
                "غير طبيعي بدرجة طفيفة يمتنع من التواصل بالبصر ، يتجنب عندما يجبر على التواصل ، الخجل بصورة مبالغ " +
                        "بها ، لا يتجاوب ، ملتصق بالوالدين أكثر من الطفل الذي بنفس عمره. ",
                " غير طبيعي بدرجة متوسطة ، انطوائي ، يحب العزلة ، لا يوجد اهتمام بالتفاعل مع المحيطين ، مقفول على " +
                        "نفسه ، تستطيع الحصول منه على القليل من التواصل . ",
                "غير طبيعي بدرجة شديدة عزلة تامة افتقاد القدرة على الاستجابة ."),
            CarsAutismModel("القدرة على التقليد والمحاكاة",
                "طبيعي يقلد الطفل الأصوات ، الكلمات ، الحركات بحيث تكون بحدود قدراته .",
                "غير طبيعي بدرجة طفيف يقوم الطفل بتقليد بعض السلوكيات البسيطة مثال يصفق ، بعض الكلمات المفردة " +
                        "ويحتاج وقت لترديد الكلمة عند سماعها .",
                "غير طبيعي بدرجة متوسطة يقلد الطفل بعض السلوكيات البسيطة ولكن يحتاج إلى وقت كبير ومساعدة .",
                "غير طبيعي بدرجة شديدة نادرا ما يقوم الطفل بالتقليد او لا يقلد نهائيا الأصوات أو الكلمات ،أو الحركات حتى " +
                        "بوجود مساعدة . "),
            CarsAutismModel("الاستجابة العاطفية",
                "طبيعي يتفاعل الطفل للمواقف السارة والغير سارة .",
                "غير طبيعي بدرجة طفيفة تظهر عليه احيانا تصرفات غير مرغوب فيها كاستجابة منفصلة عن الواقع .",
                "غير طبيعي بدرجة متوسطة مثال الضحك الشديد بدون معنى أو بدون سبب وليس له علاقة مع الواقع .",
                "غير طبيعي بدرجة شديدة إستجابة منفصلة نهائيا عن الواقع وأن كان مزاجه في شيء معين من الصعب جدا أن " +
                        "يتغير . "),
            CarsAutismModel("استخدام الجسم",
                "طبيعي تشمل التناسق والتوازن لطفل بمثل عمره .",
                "غير طبيعي بدرجة طفيفة له بعض السلوك النمطي المكرر مثال التكرار في اللعب اوالانشطة .",
                "غير طبيعي بدرجة متوسطة له سلوكيات غير مرغوب فيها واضحة لطفل في عمره مثال حركات لف الاصابع ،" +
                        "الاهتزاز ، الدوران ، الحملقة ، إيذاء النفس ، المش على الاطراف ، خبط الدماغ ، الاستمناء ، تحريك اليدين " +
                        "و رفرفتها .",
                "غير طبيعي بدرجة شديدة ، فهو يستمر في الحركات المكرره المذكورة في الاعلى حتى لو شارك في نشاط اخر . "),
            CarsAutismModel("إستخدام الاشياء ",
                "طبيعي يهتم بالالعاب والاشياء من حوله والتعامل معها واستخدامها بالطريقة الصحيحة . ",
                "غير طبيعي بدرجة طفيفة يهتم بلعبة واحدة فقط ويتعامل معها بطريقة غريبة كأن يطرقها بالارض .",
                "غير طبيعي بدرجة متوسطة يظهر عدم اهتمامه بالاشياء وان اظهر تكون بطريقة غريبة مثال يلف اللعبة طول الوقت " +
                        "وينظر لها من زاوية واحدة فقط .",
                "غير طبيعي بدرجة شديدة تكرار ماسبق ولكن بطريقة مكثفة ومن المستحيل أن ينفصل عنها إذا كان مشغولا بها . "),
            CarsAutismModel("التكيف والتأقلم",
                "طبيعي يتكيف مع الموقف والتغير للروتين .",
                "غير طبيعي بدرجة طفيفة يقاوم التغير والتكيف للموقف بعد تغير النشاط الذي تعود عليه. ",
                "غير طبيعي بدرجة متوسطة يقاوم التغير والتكيف للموقف بعد تغير النشاط الذي تعود عليه . ",
                "غير طبيعي بدرجة شديدة الاصرار على ثبات الظروف والروتين وعدم التغيير. "),
            CarsAutismModel("الاستجابة البصرية",
                "طبيعي يستخدم التواصل البصري مع الحواس لاكتشاف الشيء الجديد أمامه.",
                "غير طبيعي بدرجة طفيفة يحتاج للتذكير لكي يتواصل وينظر الى الشيء ، يهتم في النظر بالمرآة الضوء ، النظر الى" +
                        "الاعلى ، أو الفضاء ويتحاشى النظر في الاشخاص . ",
                "غير طبيعي بدرجة متوسطة يحتاج للتذكير المستمر للتواصل البصري للشيء الذي يفعله وتظهر نفس السلوكيات " +
                        "السابقة . ",
                "غير طبيعي بدرجة شديدة الامتناع عن التواصل البصري مع الاشخاص وبعض الاشياء وتظهر نفس السلوكيات " +
                        "السابقة . "),
            CarsAutismModel("استجابة الانصات(الاستماع )",
                "طبيعي ويستمع باهتمام مع عدم وجود أي مؤثرات صوتية مستخدما حواسه. ",
                "غير طبيعي بدرجة طفيفة رد فعل متاخر للاصوات يحتاج تكرار الاصوات لشد انتباهه يبالغ قليلا في رد فعل " +
                        "لبعض الاصوات .",
                "غير طبيعي بدرجة متوسطة متنوع في رد الفعل مثال يتجاهل الصوت مرارا، يقفل أذنيه لبعض الاصوات منها " +
                        "الاصوات الانسانية المكررة يوميا .",
                "غير طبيعي بدرجة شديدة مبالغ في رد الفعل للاصوات والتجاهل نهائيا للاصوات بصورة واضحة."),
            CarsAutismModel("استجابات استخدام التذوق والشم واللمس",
                "طبيعي يستجيب الطفل لمثيرات الحواس كالألم وغيرها.",
                "غير طبيعي بدرجة طفيفة يضع اشياء قي فمه يشم ويتذوق أشياء لا تؤكل يتجاهل الألم أو يبالغ به.",
                "غير طبيعي بدرجة متوسطة يبالغ باستخدام الشم والتذوق واللمس ويتجاهل الألم .",
                "غير طبيعي بدرجة شديدة فهو يبالغ كثيرا أو يتجاهل نهائيا ولا تظهر أي نوع من الشعور بالألم أو المبالغة " +
                        "الشديدة لحدث بسيط جدا. "),
            CarsAutismModel("الخوف والعصبية ",
                "طبيعي يتصرف الطفل مع الموقف مناسب لعمره .",
                "غير طبيعي بدرجة طفيفة يتصرف الطفل بصورة مبالغة أو يتجاهل الحدث قليلا بالنسبة لطفل في مثل عمره . ",
                "غير طبيعي بدرجة متوسطة يتصرف بصورة مبالغة واضحة أوتجاهل واضح بالنسبة لطفل في مثل عمره.",
                "غير طبيعي بدرجة شديدة خوف مستمر حتى عند إعادة المواقف غير الخطرة ومن الصعب جدا تهدئته وليس له " +
                        "ارداك للمواقف الخطرة والمواقف الغير خطرة. "),
            CarsAutismModel("التواصل اللفظي ",
                "طبيعي يظهر الطفل كل مظاهر النطق والكلام واللغة لعمره.",
                "غير طبيعي بدرجة طفيفة تأخر في الكلام ظهور بعض الكلام المبهم ، ترديد كلام ، لا يستخدم الضمائر أنا أنت و" +
                        "، المهمهة ، الخروج عن الحديث المألوف ، عكس المقاطع أو الكلمات . ",
                "غير طبيعي بدرجة متوسطة صمت ، وعند وجود نطق هناك ترديد كلام واضح ، همهمة .",
                "غير طبيعي بدرجة شديدة لا يستخدم اللغة في التواصل فقط همهمة واصوات غريبة أشبه بصوت الحيوان " +
                        "واظهار اصوات مزعجة. "),
            CarsAutismModel("التواصل الغير للفظي",
                "طبيعي يستخدم تعبير الوجه أو تغير الملامح والاوضاع وحركات الجسم والراس .",
                "غير طبيعي بدرجة طفيفة تواصل غير لفظي ناقص مثال يمسك اليد من الخلف لطلب المساعدة والوصول للشيء" +
                        "بطريقة تختلف عن الطرق التى يستعملها الطفل في مثل عمره. ",
                "غير طبيعي بدرجة متوسطة لا يستطيع ان يعبر عن احتياجه بالتواصل غير اللفظي ولا يستطيع فهم لغة التواصل " +
                        "غير اللفظي . ",
                "غير طبيعي بدرجة شديدة يستخدم سلوكيات غريبة غير مفهومة للتعبير عن احتياجاته مع عدم الاهتمام " +
                        "باللايماءات وتعابير وجوه الاخرين . "),
            CarsAutismModel("مستوى النشاط ",
                "طبيعي نشاطه عادي مناسب لعمره . ",
                "غير طبيعي بدرجة طفيفة يظهر نشاط زائد أو كسل زائد ويكون خاص بذاته .",
                "غير طبيعي بدرجة متوسطة نشاط زائد لا يهدء يصعب التحكم به هائم لا ينام الا قليلا فوضوي غير منتظم ، أو" +
                        "خامل لا يتحرك من مكانه ويحتاج الى جهد كبير ليتفاعل مع نشاط معين . ",
                "غير طبيعي بدرجة شديدة هائم ، نوبات غضب حركة مستمرة لا يجلس ساكنا فوضوي يرمي كل شيء على " +
                        "الارض ، يفتح ويقلب الاشياء . "),
            CarsAutismModel("مستوى وثبات الاستجابات الذهنية",
                "طبيعي في اداء المهارات في المواقف المختلفة المناسبة لعمره.",
                "غير طبيعي بدرجة طفيفة يظهر تأخر في أداء المهارات المختلفة .",
                "غير طبيعي بدرجة متوسطة تأخر في أداء المهارات ولكن من الممكن ان يتفاعل لنفس عمره في احدى " +
                        "المهارات وتاخر في باقي المهارات. ",
                "غير طبيعي بدرجة شديدة يكون أفضل من الطفل الطبيعي في مهارتين وتكون مبالغ فيها ولكن يتأخر بباقي " +
                        "المهارات . "),
        )
    }
}