package com.example.mente.Autism.Data.QuestionsSpecialist

import com.example.mente.Autism.Models.QChat10Model

class DataQChat10 {
    companion object
    {
        val QChat10Data = mutableListOf(
            QChat10Model("هل ينظر إليك طفلك عندما تناديه باسمه","دائما","عادة","احيانا","نادرا","ابدا"),
            QChat10Model("ما مدى سهولة التواصل البصري مع طفلك","سهل جدا","سهل","صعب","صعب جدا","مستحيل"),
            QChat10Model(" هل يشير طفلك للدلالة على أنه يريد شيئاً ما؟  (على سبيل المثال لعبة بعيدة عن متناول اليد) "," مرات عديدة فى اليوم","بضغ مرات فى اليوم","بضع مرات فى الاسبوع"," اقل من مرة فى الاسبوع","ابدا"),
            QChat10Model("هل يشير طفلك إلى مشاركة الاهتمام معك؟  (مثال: الإشارة إلى منظر مثير للاهتمام)  "," مرات عديدة فى اليوم","بضغ مرات فى اليوم","بضع مرات فى الاسبوع"," اقل من مرة فى الاسبوع","ابدا"),
            QChat10Model("هل يتظاهر طفلك؟  (على سبيل المثال، الاعتناء بالدمى، التحدث على هاتف لعبة)  "," مرات عديدة فى اليوم","بضغ مرات فى اليوم","بضع مرات فى الاسبوع"," اقل من مرة فى الاسبوع","ابدا"),
            QChat10Model("هل طفلك يتبع المكان الذي تنظر إليه  "," مرات عديدة فى اليوم","بضغ مرات فى اليوم","بضع مرات فى الاسبوع"," اقل من مرة فى الاسبوع","ابدا"),
            QChat10Model("-إذا كنت أنت أو أي شخص آخر في العائلة منزعجًا بشكل واضح، فهل تظهر على طفلك علامات الرغبة في تهدئته؟  (على سبيل المثال، تمسيد شعره أو احتضانه)","دائما","عادة","احيانا","نادرا","ابدا"),
            QChat10Model("هل تصف كلمات طفلك الأولى على النحو التالي","نوذجية جدا","نوذجية","غير عادية بشكل طفيف ","غير عادية جدا ","لا يتكلم"),
            QChat10Model("هل يستخدم طفلك الإيماءات البسيطة؟  (مثال: التلويح بالوداع)  "," مرات عديدة فى اليوم","بضغ مرات فى اليوم","بضع مرات فى الاسبوع"," اقل من مرة فى الاسبوع","ابدا"),
            QChat10Model(" هل يحدق طفلك في لا شيء بدون غرض واضح؟ "," مرات عديدة فى اليوم","بضغ مرات فى اليوم","بضع مرات فى الاسبوع"," اقل من مرة فى الاسبوع","ابدا"),

            )




    }
}